In [2]:
import sqlalchemy
engine = sqlalchemy.create_engine('postgresql://bob:1234@localhost:5432/test_joins')
engine.execution_options(isolation_level="AUTOCOMMIT")
%load_ext sql
%sql $engine.url

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: bob@test_joins'

# Unions
The [UNION](https://www.postgresql.org/docs/current/queries-union.html) operator allows us to combine the results of two or more [SELECT]() statements into a single result set. The general syntax for combining two `SELECT` expressions would be:

```sql
SELECT column_1, column_2
FROM table_1
UNION
SELECT column_1, column_2
FROM table_2;
```

There are a couple of restrictions when using unions:

- Both queries must return the same number of columns.
- The corresponding columns in the queries must have compatible data types.

Let's see it in action with a couple of examples using the small database we used to explain joins.

In [5]:
%%sql
SELECT * name FROM "TableA"
UNION
SELECT * name FROM "TableB";

   postgresql://bob:***@localhost:5432/dvdrental
 * postgresql://bob:***@localhost:5432/test_joins
8 rows affected.

[(3, 'Darth Vader'),
 (4, 'Ninja'),
 (1, 'Rutabaga'),
 (4, 'Spaguetti'),
 (3, 'Ninja'),
 (2, 'Monkey'),
 (1, 'Pirate'),
 (2, 'Pirate')]

As you can see, since both tables have the same number of columns and the data types in them are equal, we get all the rows in both tables without issue.

## Ordering the results
By the way, the `UNION` operator may place the rows in the first query before, after or between the rows in the result set of the second query. That can easily be remedied using the `ORDER BY` clause:

In [11]:
%%sql
SELECT id, name FROM "TableA"
UNION
SELECT id, name FROM "TableB"
ORDER BY id;

   postgresql://bob:***@localhost:5432/dvdrental
 * postgresql://bob:***@localhost:5432/test_joins
8 rows affected.

[(1, 'Rutabaga'),
 (1, 'Pirate'),
 (2, 'Pirate'),
 (2, 'Monkey'),
 (3, 'Ninja'),
 (3, 'Darth Vader'),
 (4, 'Spaguetti'),
 (4, 'Ninja')]

In [ ]:
## UNION ALL
The `UNION` operator removes all duplicate rows from the results, for example:

In [6]:
%%sql
SELECT id name FROM "TableA"
UNION
SELECT id name FROM "TableB";

   postgresql://bob:***@localhost:5432/dvdrental
 * postgresql://bob:***@localhost:5432/test_joins
4 rows affected.

[(2,), (3,), (4,), (1,)]

As you can see, we don't get the rows for the `id` columns repeated. A way around that could be using `UNION ALL`:

In [7]:
%%sql
SELECT id name FROM "TableA"
UNION ALL
SELECT id name FROM "TableB";

   postgresql://bob:***@localhost:5432/dvdrental
 * postgresql://bob:***@localhost:5432/test_joins
8 rows affected.

[(1,), (2,), (3,), (4,), (1,), (2,), (3,), (4,)]